Notes/sampleDataFiles/salesForceSamples/core calls/process.xml

<?xml version="1.0" encoding="utf-8"?>
    <soapenv:Envelope xmlns:soapenv=" http://schemas.xmlsoap.org/soap/envelope/ " xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Header>
            <urn:SessionHeader>
                <urn:sessionId><b>QwWsHJyTPW.1pd0_jXlNKOSU</b></urn:sessionId>
            </urn:SessionHeader>
        </soapenv:Header>
        <soapenv:Body>
            <urn:process>
                <urn:actions xsi:type="urn:ProcessSubmitRequest">
                    <urn:objectId><b>001D000000HRzKD</b></urn:objectId>
                    <urn:comments><b>Please approve this account.</b></urn:comments>
                </urn:actions>
            </urn:process>
        </soapenv:Body>
    </soapenv:Envelope>